In [1]:
import pandas as pd
import numpy as np

In [4]:
arr= np.array(["sun","mon","tue","wed","thr","fri","sat"])

In [10]:
# how to create pandas series

s1 = pd.Series(arr, name = "weekdays")
s1

0    sun
1    mon
2    tue
3    wed
4    thr
5    fri
6    sat
Name: weekdays, dtype: object

In [11]:
s1.name

'weekdays'

In [13]:
s2 = pd.Series([2,5,7,4], name="number list")
s2

0    2
1    5
2    7
3    4
Name: number list, dtype: int64

In [15]:
s3 = pd.Series((1,2,3,4,5))
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
#s4 = pd.series(np.random.randint(1,26,24).reshape(6,4),name= "random_numbers
## we cannot create sries more than 1 dimension

In [16]:
s3.dtype

dtype('int64')

In [19]:
s2.mean()

4.5

In [20]:
s2.std()

2.0816659994661326

In [21]:
s3.std()

1.5811388300841898

In [23]:
d ={
    "std_names":["Chandu","nandu","Bandu"],
    "marks":[67,59,46]
}
d

{'std_names': ['Chandu', 'nandu', 'Bandu'], 'marks': [67, 59, 46]}

In [25]:
df= pd.DataFrame(d)
df

  std_names  marks
0    Chandu     67
1     nandu     59
2     Bandu     46

In [26]:
arr2 = np.random.randint(35,99,24).reshape(6,4)
arr2

array([[76, 61, 78, 46],
       [79, 67, 40, 39],
       [37, 86, 35, 97],
       [65, 74, 83, 69],
       [77, 73, 82, 47],
       [98, 40, 96, 64]])

In [27]:
df2 = pd.DataFrame(arr2)
df2

    0   1   2   3
0  76  61  78  46
1  79  67  40  39
2  37  86  35  97
3  65  74  83  69
4  77  73  82  47
5  98  40  96  64

In [28]:
df3 = pd.DataFrame(arr2,columns=["math","english","Physics","sport"])
df3

   math  english  Physics  sport
0    76       61       78     46
1    79       67       40     39
2    37       86       35     97
3    65       74       83     69
4    77       73       82     47
5    98       40       96     64

In [29]:
df3["Std_Name"]= ["Sachin","Rohit","Virat","shubman","Ravindra","Rinku"]

In [30]:
df3

   math  english  Physics  sport  Std_Name
0    76       61       78     46    Sachin
1    79       67       40     39     Rohit
2    37       86       35     97     Virat
3    65       74       83     69   shubman
4    77       73       82     47  Ravindra
5    98       40       96     64     Rinku

In [ ]:
df3.head() #to return the top 5 rows of dataframe, we can return as many rows by giving number in head()

In [31]:
df3.head(2)

   math  english  Physics  sport Std_Name
0    76       61       78     46   Sachin
1    79       67       40     39    Rohit

In [33]:
df3.tail(3)

   math  english  Physics  sport  Std_Name
3    65       74       83     69   shubman
4    77       73       82     47  Ravindra
5    98       40       96     64     Rinku

In [34]:
df3.iloc[3:5]

   math  english  Physics  sport  Std_Name
3    65       74       83     69   shubman
4    77       73       82     47  Ravindra

In [35]:
df3.loc[2:4]

   math  english  Physics  sport  Std_Name
2    37       86       35     97     Virat
3    65       74       83     69   shubman
4    77       73       82     47  Ravindra

In [37]:
df3["math"]

0    76
1    79
2    37
3    65
4    77
5    98
Name: math, dtype: int32

In [38]:
type(df3["math"])

pandas.core.series.Series

In [39]:
df3.iloc[1]

math           79
english        67
Physics        40
sport          39
Std_Name    Rohit
Name: 1, dtype: object

In [40]:
df2.iloc[0].mean()

65.25

In [41]:
df3[["math","english"]]

   math  english
0    76       61
1    79       67
2    37       86
3    65       74
4    77       73
5    98       40

In [43]:
df3.drop("Std_Name",axis=1, inplace=True)

In [44]:
df3

   math  english  Physics  sport
0    76       61       78     46
1    79       67       40     39
2    37       86       35     97
3    65       74       83     69
4    77       73       82     47
5    98       40       96     64

In [ ]:
df4 = pd.read_csv("")

In [ ]:
df5 = pd.read_excel()

In [3]:
d= {
    "name":["sahil","hrsh","mahi"],
    "Age":[21,20,19],
    "marks":[25,30,35]
}
d

{'name': ['sahil', 'hrsh', 'mahi'], 'Age': [21, 20, 19], 'marks': [25, 30, 35]}

In [4]:
df=pd.DataFrame(d)
df

    name  Age  marks
0  sahil   21     25
1   hrsh   20     30
2   mahi   19     35

In [5]:
df["Subject"]=["math","science","history"]
df

    name  Age  marks  Subject
0  sahil   21     25     math
1   hrsh   20     30  science
2   mahi   19     35  history

In [6]:
new_column =["name","marks","Subject","Age"]

In [7]:
df=df.reindex(columns=new_column)

In [8]:
df

    name  marks  Subject  Age
0  sahil     25     math   21
1   hrsh     30  science   20
2   mahi     35  history   19

In [10]:
df.insert(4,"Work",["manager","HOD","CEO"])

In [11]:
df

    name  marks  Subject  Age     Work
0  sahil     25     math   21  manager
1   hrsh     30  science   20      HOD
2   mahi     35  history   19      CEO

In [14]:
arr = np.array([1,2,3,4,5])
indices=np.array([1,3])
result=arr[indices]
print(result)

[2 4]